[
    {
        "date": "2024-02-12",
        "title": " New Song Release by Corla Reefer",
        "content": "We are excited release of a song titled 'Electro' by Corla Reefer, marking our 23rd song out of our target launch goal of 1000. Thank you for your continued support along this musical journey.</p>"
    },
    {
        "date": "2024-02-15",
        "title": "New Rob Show",
        "content": "<h1>Rob Show #18 | My Own Grenade</h1> <p>We announce The Rob Show, featuring My Own Gernade. What started as a high school friendship has led to a lifetime of music, and Rob is here to dive deep into their journey.</p> "
    },
    {
        "date": "2024-02-20",
        "title": "Added My Own Grenade Music - to the Mix",
        "content": "Last week we had My Own Grenade on the Rob Show and fell in love with these folks - they have generously given Ahoy permission to stream their work! We added 6 to the Mix. <br><br> For more of My Own Grenade - here is a brief about them: My Own Grenade is a Connecticut based hard rock/punk band. Founded in 1996, Tim Rooney (vocals), Mike Reid (guitar/vocals), Mike Testa (guitar), Chris Siano (bass), and Buddy Oberheim (drums) are dedicated to writing, recording, and performing original songs. My Own Grenade was voted the #2 punk band in the New Haven area in the 1999 Great Band Slam sponsored by the New Haven Advocate. After releasing our debut CD, Randal's Last Stand, we've been writing new material for our second release due out in summer 2000. Connecticut appearances have included Toad's Place and the Tune Inn (New Haven), the Webster Theater (Hartford), and Shenanigans (Norwalk). We have also played Don Hill's and The Spiral Lounge in New York City. 3 out of 4 fans report that repeated exposure to My Own Grenade increased their listening pleasure. Side effects include hot flashes, sweaty palms, and decreased dancing inhibitions. When used regularly, MOG is proven to cause a ruckus. In August 1998 and June 1999, we performed live on WRIU (90.3 FM), the University of Rhode Island radio station. In 1997, we were selected as finalists in the 'Modern Rock Wars' sponsored by WMRQ (104.1) in Hartford."
    }


    
]